tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgs3D/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance 1e-12;

pointSync true;

patchInfo
(
    {
        name             infinity;
        constructFrom    set;
        set              faceSet_geometry_infinity;

        dictionary
        {
            type         patch;
        }
    }
);

// OpenFOAM syntax
patches
(
);

// ************************************************************************* //
