tutorialsOld/surfaceTracking/interTrackMHDmagFoam/rgs3D/0.org/VRe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      VRe;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    infinity
    {
//         type            normalizedZeroGradient;
        type            zeroGradient;
//         type            fixedValue;
//         value           uniform 0;
    }
    "procBoundary.*"
    {
        type            processor;
        value           uniform 0;
    }
}

// ************************************************************************* //
